xdtoОбъект = сшпОбщегоНазначения.ПолучитьОбъектXDTO(ФорматСообщения, ОбъектСообщение.Body);

ПоляЗапросаДанных = xdtoОбъект.Получить("ПоляЗапросаДанных");
Если ПоляЗапросаДанных <> Неопределено Тогда
	
	ПоляЗапросаДанныхПосл = ПоляЗапросаДанных.Последовательность();
	ВГраница = ПоляЗапросаДанныхПосл.Количество()-1;
	Для Инд = 0 По ВГраница Цикл
		xdtoСтрока = ПоляЗапросаДанныхПосл.ПолучитьЗначение(Инд);
		
		ТипДанных = xdtoСтрока.Получить("ТипДанных");
		ЗначениеПоля = xdtoСтрока.Получить("ЗначениеПоля");
		
		Если ТипДанных = "Валюта" Тогда
			Менеджер = Справочники.Валюты;
		ИначеЕсли ТипДанных = "Контрагент" Тогда
			Менеджер = Справочники.Контрагенты;
		ИначеЕсли ТипДанных = "Склад" Тогда
			Менеджер = Справочники.Склады;
		ИначеЕсли ТипДанных = "Организация" Тогда
			Менеджер = Справочники.Организации;		
		ИначеЕсли ТипДанных = "Товар" Тогда
			Менеджер = Справочники.Номенклатура;		
		Иначе
			Продолжить;
		КонецЕсли;
		
		ИсточникСсылка = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(ЗначениеПоля));
		ИсточникОбъект = ИсточникСсылка.ПолучитьОбъект();
		Если ИсточникОбъект <> Неопределено Тогда
			сшпОбработкаСобытий.ВыполнитьОбменСШП(ИсточникОбъект, Ложь);
		КонецЕсли;
	КонецЦикла;
	
Иначе 
	СостояниеСообщения = Перечисления.сшпСтатусыСообщений.ОбработкаОтменена;	
КонецЕсли;
