//Секция препроцессорных переменных и инициализации параметров алгоритма
ЗадержкаЗапросаДанных = $ЗадержкаЗапросаДанных;

//секция контекстной подсказки
Если Ложь Тогда //контекстная подсказка и контроль синтаксиса 
	
	//РежимыВыполненияАлгоритма
	НенайденныеОбъектыРежим = "Заполнение";		//Заполнение списка ненайденных объектов
	НенайденныеОбъектыРежим = "Отправка";		//Формирование пакета с запросом данных
	
	//Переменные для контроля синтаксиса
	СсылкаДляПоиска = Неопределено; 			//Ссылка для проверки наличия объекта в базе
	ТипДанныхДляПоиска = ""; 					//Строка тип нененайденного объекта
	Значение = "";								//Строка - уникальный идентификатор для поиска
												//объекта в базе источнике
	
КонецЕсли;

//////////////
Если НенайденныеОбъектыРежим = "Заполнение" Тогда
	//Запрос данных - заполняем список ненайденных объектов
	
	Если СсылкаДляПоиска.ПолучитьОбъект() = Неопределено  Тогда
		стрНенайденныеОбъекты = Новый Структура;
		стрНенайденныеОбъекты.Вставить("ТипДанных", ТипДанныхДляПоиска);
		стрНенайденныеОбъекты.Вставить("ЗначениеПоля", Значение);
		НенайденныеОбъектыМассив.Добавить(стрНенайденныеОбъекты);
	КонецЕсли;
	
ИначеЕсли НенайденныеОбъектыРежим = "Отправка" Тогда
	//Запрос данных - Формирование пакета с запросом данных и помещение
	//в очередь исходящих
	
	Если НенайденныеОбъектыМассив.Количество()>0 Тогда
		
		СостояниеСообщения = Перечисления.сшпСтатусыСообщений.ОжиданиеОбработки;
		Задержка = ЗадержкаЗапросаДанных;
		
		Данные = Новый Структура;
		Данные.Вставить("ПоляЗапросаДанных", НенайденныеОбъектыМассив);
		
		ТипОбъектаСобытия = "ЗапросДанных";
		ЗначениеХранения = сшпОбщегоНазначения.ПреобразоватьСтруктуруПоФормату(ФорматСообщения, Данные);
		ФорматСериализация = Перечисления.сшпФорматыСообщений.XML;
		МетодХранения = Перечисления.сшпМетодХранения.ПоСсылке;
		
		сшпРаботаСДанными.ПоместитьВОчередьИсходящих(ТипОбъектаСобытия, ЗначениеХранения, ФорматСериализация, МетодХранения);
		
		ЗаписьЖурналаРегистрации(
		"Datareon. ЗапросДанных", УровеньЖурналаРегистрации.Предупреждение,, 
		Идентификатор, "Тело пакета с запросом данных: " + ЗначениеХранения
		);
		
	КонецЕсли;	
	
	
КонецЕсли;
