ЗадержкаЗапросаДанных = $ЗадержкаЗапросаДанных;	
	
	//Запрос данных - обработка
	Если НенайденныеОбъектыМассив.Количество()>0 Тогда
		
		СостояниеСообщения = Перечисления.сшпСтатусыСообщений.ОжиданиеОбработки;
		Задержка = ЗадержкаЗапросаДанных;
		
		Данные = Новый Структура;
		Данные.Вставить("ПоляЗапросаДанных", НенайденныеОбъектыМассив);
		
		ТипОбъекта = "ЗапросДанных";
		ЗначениеХранения = сшпОбщегоНазначения.ПреобразоватьСтруктуруПоФормату(ФорматСообщения, Данные);
		ФорматСериализация = Перечисления.сшпФорматыСообщений.XML;
		МетодХранения = Перечисления.сшпМетодХранения.ПоСсылке;
		
		сшпРаботаСДанными.ПоместитьВОчередьИсходящих(ТипОбъекта, ЗначениеХранения, ФорматСериализация, МетодХранения);
		
		ЗаписьЖурналаРегистрации(
		"Datareon. ЗапросДанных", УровеньЖурналаРегистрации.Предупреждение,, 
		Идентификатор, "Текст запроса данных в обработчике (ESW-1.УФ.Поступления.In) " + ЗначениеХранения
		);
		
	КонецЕсли;	
