РезультатОбработки.ClassId = 55;

Данные = Новый Структура;
Данные.Вставить("Ссылка", ОбъектОбработки);
Данные.Вставить("ПометкаУдаления", ОбъектОбработки.ПометкаУдаления);
Данные.Вставить("Дата", ОбъектОбработки.Дата);
Данные.Вставить("Поставщик", ОбъектОбработки.Контрагент);
Данные.Вставить("Склад", ОбъектОбработки.Склад);
Данные.Вставить("Организация", ОбъектОбработки.Организация);
Данные.Вставить("Валюта", ОбъектОбработки.ДоговорКонтрагента.ВалютаВзаиморасчетов);

мсвТаблица = Новый Массив;
Для каждого текСтрока из ОбъектОбработки.Товары цикл
		Товары = Новый Структура;
		Товары.Вставить("Товар", текСтрока.Номенклатура);
		Товары.Вставить("Цена", текСтрока.Цена);
		Товары.Вставить("Количество", текСтрока.Количество);
		Товары.Вставить("Сумма", текСтрока.Сумма);

		мсвТаблица.Добавить(Товары);
КонецЦикла; 
Данные.Вставить("Товары", мсвТаблица);

РезультатОбработки.Body = сшпОбщегоНазначения.ПреобразоватьСтруктуруПоФормату(ФорматСообщения, Данные);
