РезультатОбработки.ClassId = 54;

Данные = Новый Структура;
Данные.Вставить("Ссылка", ОбъектОбработки.Ссылка);
Данные.Вставить("ПометкаУдаления", ОбъектОбработки.ПометкаУдаления);
Данные.Вставить("ЭтоГруппа", ОбъектОбработки.ЭтоГруппа);
Данные.Вставить("Родитель", ОбъектОбработки.Родитель);
Данные.Вставить("Наименование", ОбъектОбработки.Наименование);
Данные.Вставить("Код", ОбъектОбработки.Код);
Данные.Вставить("Артикул", ОбъектОбработки.Артикул);
Данные.Вставить("Поставщик", ОбъектОбработки.Производитель);

РезультатОбработки.Body = сшпОбщегоНазначения.ПреобразоватьСтруктуруПоФормату(ФорматСообщения, Данные);
