РезультатОбработки.ClassId = 52;

Данные = Новый Структура;
Данные.Вставить("ПометкаУдаления", ОбъектОбработки.ПометкаУдаления);
Данные.Вставить("ЭтоГруппа", ОбъектОбработки.ЭтоГруппа);
Данные.Вставить("Родитель", ОбъектОбработки.Родитель);
Данные.Вставить("Наименование", ОбъектОбработки.Наименование);
Данные.Вставить("Код", ОбъектОбработки.Код);
Данные.Вставить("Ссылка", ОбъектОбработки.Ссылка);

РезультатОбработки.Body = сшпОбщегоНазначения.ПреобразоватьСтруктуруПоФормату(ФорматСообщения, Данные);
