Если ОбъектОбработки.ЭтоГруппа Тогда
	СостояниеСообщения = Перечисления.сшпСтатусыСообщений.ОбработкаОтменена;
Иначе


РезультатОбработки.ClassId = 51;

Данные = Новый Структура;
Данные.Вставить("Ссылка", ОбъектОбработки.Ссылка);
Данные.Вставить("ПометкаУдаления", ОбъектОбработки.ПометкаУдаления);
Данные.Вставить("Наименование", ОбъектОбработки.Наименование);
Данные.Вставить("Код", ОбъектОбработки.Код);
Данные.Вставить("НеИспользовать", ОбъектОбработки.ЭтоГруппа);

РезультатОбработки.Body = сшпОбщегоНазначения.ПреобразоватьСтруктуруПоФормату(ФорматСообщения, Данные);

КонецЕсли;
