//Определение переменных
ПустойИдентификатор = "00000000-0000-0000-0000-000000000000";

//Получение тела сообщения
xdtoОбъект = сшпОбщегоНазначения.ПолучитьОбъектXDTO(ФорматСообщения, ОбъектСообщение.Body);

//Поиск объекта
ЗначениеДляПоиска = Новый УникальныйИдентификатор(xdtoОбъект.Ссылка);
СсылкаНаЭлемент = Справочники.Контрагенты.ПолучитьСсылку(ЗначениеДляПоиска);

новыйОбъект = СсылкаНаЭлемент.ПолучитьОбъект();
Если новыйОбъект = Неопределено тогда
	ЭтоГруппа = xdtoОбъект.Получить("ЭтоГруппа");
	Если ЭтоГруппа тогда
		новыйОбъект = Справочники.Контрагенты.СоздатьГруппу();
	Иначе
		новыйОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	КонецЕсли;	
	новыйОбъект.УстановитьСсылкуНового(СсылкаНаЭлемент);
КонецЕсли;


////////////////////////////////////////////////////////////////////////////////
//Реквизиты шапки

//Родитель
Значение = xdtoОбъект.Получить("Родитель");
Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
    новыйОбъект.Родитель = Справочники.Контрагенты.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
Иначе
    новыйОбъект.Родитель = Справочники.Контрагенты.ПустаяСсылка();
КонецЕсли;

//Наименование
новыйОбъект.Наименование = xdtoОбъект.Получить("Наименование");

//Код
новыйОбъект.Код = xdtoОбъект.Получить("Код");


//Запись объекта
новыйОбъект.ДополнительныеСвойства.Вставить("СШПНеобрабатывать", Истина);
новыйОбъект.Записать();
