//Определение переменных
ПустойИдентификатор = "00000000-0000-0000-0000-000000000000";
ЗадержкаБлокировки = $ЗадержкаБлокировки;
ЗадержкаЗапросаДанных = $ЗадержкаЗапросаДанных;

//Получение тела сообщения
xdtoОбъект = сшпОбщегоНазначения.ПолучитьОбъектXDTO(ФорматСообщения, ОбъектСообщение.Body);

НачатьТранзакцию();
Попытка
	
	ЗначениеДляПоиска = Новый УникальныйИдентификатор(xdtoОбъект.Ссылка);
	СсылкаНаЭлемент = Документы.ПриходТовара.ПолучитьСсылку(ЗначениеДляПоиска);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Документ.ПриходТовара");
	ЭлементБлокировки.УстановитьЗначение("Ссылка", СсылкаНаЭлемент);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Попытка
		Блокировка.Заблокировать();
	Исключение
		ОтменитьТранзакцию();
		СостояниеСообщения = Перечисления.сшпСтатусыСообщений.ОжиданиеОбработки;
		Задержка = ЗадержкаБлокировки;
		ЗаписьЖурналаРегистрации(
		"Datareon. Обработка сообщения", УровеньЖурналаРегистрации.Предупреждение,, 
		Идентификатор, "Ожидание установки блокировки на ключ " + xdtoОбъект.Ссылка
		);
		Перейти ~Выход;
	КонецПопытки;	
	
	//Поиск объекта
	
	новыйОбъект = СсылкаНаЭлемент.ПолучитьОбъект();
	Если новыйОбъект = Неопределено тогда
		новыйОбъект = Документы.ПриходТовара.СоздатьДокумент();
		новыйОбъект.УстановитьСсылкуНового(СсылкаНаЭлемент);
	КонецЕсли;
	
	//Запрос данных - создаём список
	НенайденныеОбъектыМассив = Новый Массив;
	
	////////////////////////////////////////////////////////////////////////////////
	//Реквизиты шапки
	
	//Дата
	новыйОбъект.Дата = ?(ЗначениеЗаполнено(xdtoОбъект.Получить("Дата")), XMLЗначение(Тип("Дата"), xdtoОбъект.Получить("Дата")), Дата(1,1,1));
	
	//Поставщик
	Значение = xdtoОбъект.Получить("Поставщик");
	Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
		новыйОбъект.Поставщик = Справочники.Контрагенты.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
		//Запрос данных - заполняем список
		Если новыйОбъект.Поставщик.ПолучитьОбъект() = Неопределено  Тогда
			стрНенайденныеОбъекты = Новый Структура;
			стрНенайденныеОбъекты.Вставить("ТипДанных", "Контрагент");
			стрНенайденныеОбъекты.Вставить("ЗначениеПоля", Значение);
			НенайденныеОбъектыМассив.Добавить(стрНенайденныеОбъекты);
		КонецЕсли;
	Иначе
		новыйОбъект.Поставщик = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	//Склад
	Значение = xdtoОбъект.Получить("Склад");
	Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
		новыйОбъект.Склад = Справочники.Склады.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
		//Запрос данных - заполняем список
		Если новыйОбъект.Склад.ПолучитьОбъект() = Неопределено  Тогда
			стрНенайденныеОбъекты = Новый Структура;
			стрНенайденныеОбъекты.Вставить("ТипДанных", "Склад");
			стрНенайденныеОбъекты.Вставить("ЗначениеПоля", Значение);
			НенайденныеОбъектыМассив.Добавить(стрНенайденныеОбъекты);
		КонецЕсли;
	Иначе
		новыйОбъект.Склад = Справочники.Склады.ПустаяСсылка();
	КонецЕсли;
	
	//Организация
	Значение = xdtoОбъект.Получить("Организация");
	Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
		новыйОбъект.Организация = Справочники.Организации.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
		//Запрос данных - заполняем список
		Если новыйОбъект.Организация.ПолучитьОбъект() = Неопределено  Тогда
			стрНенайденныеОбъекты = Новый Структура;
			стрНенайденныеОбъекты.Вставить("ТипДанных", "Организация");
			стрНенайденныеОбъекты.Вставить("ЗначениеПоля", Значение);
			НенайденныеОбъектыМассив.Добавить(стрНенайденныеОбъекты);
		КонецЕсли;
	Иначе
		новыйОбъект.Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	//Валюта
	Значение = xdtoОбъект.Получить("Валюта");
	Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
		новыйОбъект.Валюта = Справочники.Валюты.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
		//Запрос данных - заполняем список
		Если новыйОбъект.Валюта.ПолучитьОбъект() = Неопределено  Тогда
			стрНенайденныеОбъекты = Новый Структура;
			стрНенайденныеОбъекты.Вставить("ТипДанных", "Валюта");
			стрНенайденныеОбъекты.Вставить("ЗначениеПоля", Значение);
			НенайденныеОбъектыМассив.Добавить(стрНенайденныеОбъекты);
		КонецЕсли;
	Иначе
		новыйОбъект.Валюта = Справочники.Валюты.ПустаяСсылка();
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////
	//Табличные части
	
	
	//Табличная часть Товары
	новыйОбъект.Товары.Очистить();
	текТаблица = xdtoОбъект.Товары.Последовательность();
	Для Инд = 0 По текТаблица.Количество()-1 Цикл
		xdtoСтрока= текТаблица.ПолучитьЗначение(Инд);
		текСтрока = новыйОбъект.Товары.Добавить();
		
		//Товар
		Значение = xdtoСтрока.Получить("Товар");
		Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
			текСтрока.Товар = Справочники.Товары.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
			//Запрос данных - заполняем список
			Если текСтрока.Товар.ПолучитьОбъект() = Неопределено  Тогда
				стрНенайденныеОбъекты = Новый Структура;
				стрНенайденныеОбъекты.Вставить("ТипДанных", "Товар");
				стрНенайденныеОбъекты.Вставить("ЗначениеПоля", Значение);
				НенайденныеОбъектыМассив.Добавить(стрНенайденныеОбъекты);
			КонецЕсли;
		Иначе
			текСтрока.Товар = Справочники.Товары.ПустаяСсылка();
		КонецЕсли;
		
		//Цена
		текСтрока.Цена = xdtoСтрока.Получить("Цена");
		
		//Количество
		текСтрока.Количество = xdtoСтрока.Получить("Количество");
		
		//Сумма
		текСтрока.Сумма = xdtoСтрока.Получить("Сумма");
	КонецЦикла;
	
	//Запрос данных - обработка
	Если НенайденныеОбъектыМассив.Количество()>0 Тогда
		
		СостояниеСообщения = Перечисления.сшпСтатусыСообщений.ОжиданиеОбработки;
		Задержка = ЗадержкаЗапросаДанных;
		
		Данные = Новый Структура;
		Данные.Вставить("ПоляЗапросаДанных", НенайденныеОбъектыМассив);
		
		ТипОбъекта = "ЗапросДанных";
		ЗначениеХранения = сшпОбщегоНазначения.ПреобразоватьСтруктуруПоФормату(ФорматСообщения, Данные);
		ФорматСериализация = Перечисления.сшпФорматыСообщений.XML;
		МетодХранения = Перечисления.сшпМетодХранения.ПоСсылке;
		
		сшпРаботаСДанными.ПоместитьВОчередьИсходящих(ТипОбъекта, ЗначениеХранения, ФорматСериализация, МетодХранения);
		
		ЗаписьЖурналаРегистрации(
		"Datareon. ЗапросДанных", УровеньЖурналаРегистрации.Предупреждение,, 
		Идентификатор, "Текст запроса данных в обработчике (ESW-1.УФ.Поступления.In) " + ЗначениеХранения
		);
		
	КонецЕсли;	
	
	
	//Запись объекта
	новыйОбъект.ДополнительныеСвойства.Вставить("СШПНеобрабатывать", Истина);
	новыйОбъект.ОбменДанными.Загрузка = Истина;
	новыйОбъект.Записать();
	
	ЗафиксироватьТранзакцию();	
Исключение
	Пока ТранзакцияАктивна() Цикл
		ОтменитьТранзакцию();
	КонецЦикла;
	ВызватьИсключение;
КонецПопытки;
