//Определение переменных
ПустойИдентификатор = "00000000-0000-0000-0000-000000000000";

//Получение тела сообщения
xdtoОбъект = сшпОбщегоНазначения.ПолучитьОбъектXDTO(ФорматСообщения, ОбъектСообщение.Body);

//Поиск объекта
ЗначениеДляПоиска = Новый УникальныйИдентификатор(xdtoОбъект.Ссылка);
СсылкаНаЭлемент = Справочники.Товары.ПолучитьСсылку(ЗначениеДляПоиска);

новыйОбъект = СсылкаНаЭлемент.ПолучитьОбъект();
Если новыйОбъект = Неопределено тогда
	ЭтоГруппа = xdtoОбъект.Получить("ЭтоГруппа");
	Если ЭтоГруппа тогда
		новыйОбъект = Справочники.Товары.СоздатьГруппу();
	Иначе
		новыйОбъект = Справочники.Товары.СоздатьЭлемент();
	КонецЕсли;	
	новыйОбъект.УстановитьСсылкуНового(СсылкаНаЭлемент);
КонецЕсли;

////////////////////////////////////////////////////////////////////////////////
//Реквизиты шапки

//Родитель
Значение = xdtoОбъект.Получить("Родитель");
Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
    новыйОбъект.Родитель = Справочники.Товары.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
Иначе
    новыйОбъект.Родитель = Справочники.Товары.ПустаяСсылка();
КонецЕсли;

//Наименование
новыйОбъект.Наименование = xdtoОбъект.Получить("Наименование");

//Код
//новыйОбъект.Код = xdtoОбъект.Получить("Код");

//Артикул
новыйОбъект.Артикул = xdtoОбъект.Получить("Артикул");

//Поставщик
Значение = xdtoОбъект.Получить("Поставщик");
Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
    новыйОбъект.Поставщик = Справочники.Контрагенты.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
Иначе
    новыйОбъект.Поставщик = Справочники.Контрагенты.ПустаяСсылка();
КонецЕсли;


//Запись объекта
новыйОбъект.ДополнительныеСвойства.Вставить("СШПНеобрабатывать", Истина);
новыйОбъект.Записать();
