//Определение переменных
ПустойИдентификатор = "00000000-0000-0000-0000-000000000000";

//Получение тела сообщения
xdtoОбъект = сшпОбщегоНазначения.ПолучитьОбъектXDTO(ФорматСообщения, ОбъектСообщение.Body);

//Поиск объекта
ЗначениеДляПоиска = xdtoОбъект.Код;
новыйОбъект = Справочники.Валюты.НайтиПоКоду(ЗначениеДляПоиска);

Если новыйОбъект = Неопределено ИЛИ новыйОбъект.Пустая() Тогда
		новыйОбъект = Справочники.Валюты.СоздатьЭлемент();
Иначе
		новыйОбъект = новыйОбъект.ПолучитьОбъект();
КонецЕсли;


////////////////////////////////////////////////////////////////////////////////
//Реквизиты шапки

//Наименование
новыйОбъект.Наименование = xdtoОбъект.Получить("Наименование");

//Код
новыйОбъект.Код = xdtoОбъект.Получить("Код");

//ЗагружаетсяИзИнтернета
новыйОбъект.ЗагружаетсяИзИнтернета = xdtoОбъект.Получить("ЗагружаетсяИзИнтернета");

//НаименованиеПолное
новыйОбъект.НаименованиеПолное = xdtoОбъект.Получить("НаименованиеПолное");

//Наценка
новыйОбъект.Наценка = xdtoОбъект.Получить("Наценка");

//ОсновнаяВалюта
Значение = xdtoОбъект.Получить("ОсновнаяВалюта");
Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
    новыйОбъект.ОсновнаяВалюта = Справочники.Валюты.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
Иначе
    новыйОбъект.ОсновнаяВалюта = Справочники.Валюты.ПустаяСсылка();
КонецЕсли;

//ПараметрыПрописи
новыйОбъект.ПараметрыПрописи = xdtoОбъект.Получить("ПараметрыПрописи");

//ФормулаРасчетаКурса
новыйОбъект.ФормулаРасчетаКурса = xdtoОбъект.Получить("ФормулаРасчетаКурса");

//СпособУстановкиКурса
Значение = xdtoОбъект.Получить("СпособУстановкиКурса");
Если ЗначениеЗаполнено(Значение) Тогда
    новыйОбъект.СпособУстановкиКурса = XMLЗначение(Тип("ПеречислениеСсылка.СпособыУстановкиКурсаВалюты"), Значение);
Иначе
    новыйОбъект.СпособУстановкиКурса = Перечисления.СпособыУстановкиКурсаВалюты.ПустаяСсылка();
КонецЕсли;


//Запись объекта
новыйОбъект.ДополнительныеСвойства.Вставить("СШПНеобрабатывать", Истина);
новыйОбъект.Записать();
