//Определение переменных
ПустойИдентификатор = "00000000-0000-0000-0000-000000000000";

//Получение тела сообщения
xdtoОбъект = сшпОбщегоНазначения.ПолучитьОбъектXDTO(ФорматСообщения, ОбъектСообщение.Body);

//Поиск объекта
ЗначениеДляПоиска = xdtoОбъект.Код;
новыйОбъект = Справочники.нсиМТР.НайтиПоКоду(ЗначениеДляПоиска);

Если новыйОбъект = Неопределено ИЛИ новыйОбъект.Пустая() Тогда
		новыйОбъект = Справочники.нсиМТР.СоздатьЭлемент();
Иначе
		новыйОбъект = новыйОбъект.ПолучитьОбъект();
КонецЕсли;


////////////////////////////////////////////////////////////////////////////////
//Реквизиты шапки

//MDM_Key
новыйОбъект.MDM_Key = xdtoОбъект.Получить("MDM_Key");

//ОбластьДанныхОсновныеДанные
новыйОбъект.ОбластьДанныхОсновныеДанные = xdtoОбъект.Получить("ОбластьДанныхОсновныеДанные");

//нсиЗаявка
Значение = xdtoОбъект.Получить("нсиЗаявка");
Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
    новыйОбъект.нсиЗаявка = БизнесПроцессы.Задание.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
Иначе
    новыйОбъект.нсиЗаявка = БизнесПроцессы.Задание.ПустаяСсылка();
КонецЕсли;

//нсиРучноеИзменение
новыйОбъект.нсиРучноеИзменение = xdtoОбъект.Получить("нсиРучноеИзменение");


////////////////////////////////////////////////////////////////////////////////
//Табличные части


//Табличная часть АльтернативныеЕдиницыИзмерения
новыйОбъект.АльтернативныеЕдиницыИзмерения.Очистить();
текТаблица = xdtoОбъект.АльтернативныеЕдиницыИзмерения.Последовательность();
Для Инд = 0 По текТаблица.Количество()-1 Цикл
		xdtoСтрока= текТаблица.ПолучитьЗначение(Инд);
		текСтрока = новыйОбъект.АльтернативныеЕдиницыИзмерения.Добавить();

		//ЕдиницаИзмерения
		Значение = xdtoСтрока.Получить("ЕдиницаИзмерения");
		Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
		    текСтрока.ЕдиницаИзмерения = Справочники.нсиЕдиницыИзмерения.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
		Иначе
		    текСтрока.ЕдиницаИзмерения = Справочники.нсиЕдиницыИзмерения.ПустаяСсылка();
		КонецЕсли;

		//Коэффициент
		текСтрока.Коэффициент = xdtoСтрока.Получить("Коэффициент");

		//Назначение
		текСтрока.Назначение = xdtoСтрока.Получить("Назначение");
КонецЦикла;


//Табличная часть ТехническиеХарактеристики
новыйОбъект.ТехническиеХарактеристики.Очистить();
текТаблица = xdtoОбъект.ТехническиеХарактеристики.Последовательность();
Для Инд = 0 По текТаблица.Количество()-1 Цикл
		xdtoСтрока= текТаблица.ПолучитьЗначение(Инд);
		текСтрока = новыйОбъект.ТехническиеХарактеристики.Добавить();

		//НаименованиеХарактеристики
		Значение = xdtoСтрока.Получить("НаименованиеХарактеристики");
		Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
		    текСтрока.НаименованиеХарактеристики = ПланыВидовХарактеристик.нсиНаименованияХарактеристикМТР.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
		Иначе
		    текСтрока.НаименованиеХарактеристики = ПланыВидовХарактеристик.нсиНаименованияХарактеристикМТР.ПустаяСсылка();
		КонецЕсли;

		//Характеристика
		Значение = xdtoСтрока.Получить("Характеристика");
		Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
		    текСтрока.Характеристика = ПланыВидовХарактеристик.нсиХарактеристикиМТР.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
		Иначе
		    текСтрока.Характеристика = ПланыВидовХарактеристик.нсиХарактеристикиМТР.ПустаяСсылка();
		КонецЕсли;

		//Значение
		Значение = xdtoСтрока.Получить("Значение");
		Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
		    текСтрока.Значение = Справочники.нсиУниверсальныйФункциональныйСправочник.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
		Иначе
		    текСтрока.Значение = Справочники.нсиУниверсальныйФункциональныйСправочник.ПустаяСсылка();
		КонецЕсли;
КонецЦикла;


//Табличная часть ДополнительнаяКлассификация
новыйОбъект.ДополнительнаяКлассификация.Очистить();
текТаблица = xdtoОбъект.ДополнительнаяКлассификация.Последовательность();
Для Инд = 0 По текТаблица.Количество()-1 Цикл
		xdtoСтрока= текТаблица.ПолучитьЗначение(Инд);
		текСтрока = новыйОбъект.ДополнительнаяКлассификация.Добавить();

		//ВидКлассификатора
		Значение = xdtoСтрока.Получить("ВидКлассификатора");
		Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
		    текСтрока.ВидКлассификатора = Справочники.нсиВидыДополнительныхКлассификаторов.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
		Иначе
		    текСтрока.ВидКлассификатора = Справочники.нсиВидыДополнительныхКлассификаторов.ПустаяСсылка();
		КонецЕсли;

		//Класс
		Значение = xdtoСтрока.Получить("Класс");
		Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
		    текСтрока.Класс = Справочники.нсиДополнительныеКлассификаторы.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
		Иначе
		    текСтрока.Класс = Справочники.нсиДополнительныеКлассификаторы.ПустаяСсылка();
		КонецЕсли;
КонецЦикла;


//Табличная часть ДополнительныеРеквизиты
новыйОбъект.ДополнительныеРеквизиты.Очистить();
текТаблица = xdtoОбъект.ДополнительныеРеквизиты.Последовательность();
Для Инд = 0 По текТаблица.Количество()-1 Цикл
		xdtoСтрока= текТаблица.ПолучитьЗначение(Инд);
		текСтрока = новыйОбъект.ДополнительныеРеквизиты.Добавить();

		//Свойство
		Значение = xdtoСтрока.Получить("Свойство");
		Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
		    текСтрока.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
		Иначе
		    текСтрока.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка();
		КонецЕсли;

		//Значение
		Значение = xdtoСтрока.Получить("Значение");
		Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
		    текСтрока.Значение = Справочники.нсиОрганизационноПравовыеФормы.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
		Иначе
		    текСтрока.Значение = Справочники.нсиОрганизационноПравовыеФормы.ПустаяСсылка();
		КонецЕсли;

		//ТекстоваяСтрока
		текСтрока.ТекстоваяСтрока = xdtoСтрока.Получить("ТекстоваяСтрока");
КонецЦикла;


//Табличная часть Аналоги
новыйОбъект.Аналоги.Очистить();
текТаблица = xdtoОбъект.Аналоги.Последовательность();
Для Инд = 0 По текТаблица.Количество()-1 Цикл
		xdtoСтрока= текТаблица.ПолучитьЗначение(Инд);
		текСтрока = новыйОбъект.Аналоги.Добавить();

		//Аналог
		Значение = xdtoСтрока.Получить("Аналог");
		Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
		    текСтрока.Аналог = Справочники.нсиМТР.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
		Иначе
		    текСтрока.Аналог = Справочники.нсиМТР.ПустаяСсылка();
		КонецЕсли;
КонецЦикла;


//Табличная часть Запчасти
новыйОбъект.Запчасти.Очистить();
текТаблица = xdtoОбъект.Запчасти.Последовательность();
Для Инд = 0 По текТаблица.Количество()-1 Цикл
		xdtoСтрока= текТаблица.ПолучитьЗначение(Инд);
		текСтрока = новыйОбъект.Запчасти.Добавить();

		//Запчасть
		Значение = xdtoСтрока.Получить("Запчасть");
		Если Значение <> ПустойИдентификатор И ЗначениеЗаполнено(Значение) Тогда
		    текСтрока.Запчасть = Справочники.нсиМТР.ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
		Иначе
		    текСтрока.Запчасть = Справочники.нсиМТР.ПустаяСсылка();
		КонецЕсли;
КонецЦикла;

//Код
новыйОбъект.Код = xdtoОбъект.Получить("Код");

//Наименование
новыйОбъект.Наименование = xdtoОбъект.Получить("Наименование");

//Артикул
новыйОбъект.Артикул = xdtoОбъект.Получить("Артикул");

//КаталожныйНомер
новыйОбъект.КаталожныйНомер = xdtoОбъект.Получить("КаталожныйНомер");


//Запись объекта
новыйОбъект.ДополнительныеСвойства.Вставить("СШПНеобрабатывать", Истина);
новыйОбъект.Записать();
