РезультатОбработки.ClassId = 2;
Данные = Новый Структура;

Данные.Вставить("MDM_Key", ОбъектОбработки.MDM_Key);
Данные.Вставить("ОбластьДанныхОсновныеДанные", ОбъектОбработки.ОбластьДанныхОсновныеДанные);
Данные.Вставить("нсиЗаявка", ОбъектОбработки.нсиЗаявка);
Данные.Вставить("нсиРучноеИзменение", ОбъектОбработки.нсиРучноеИзменение);

мсвТаблица = Новый Массив;
Для Каждого текСтрока Из ОбъектОбработки.АльтернативныеЕдиницыИзмерения Цикл 
		сткСтрока = Новый Структура;
		сткСтрока.Вставить("ЕдиницаИзмерения", текСтрока.ЕдиницаИзмерения);
		сткСтрока.Вставить("Коэффициент", текСтрока.Коэффициент);
		сткСтрока.Вставить("Назначение", текСтрока.Назначение);
		мсвТаблица.Добавить(сткСтрока);
КонецЦикла; 
Данные.Вставить("АльтернативныеЕдиницыИзмерения", мсвТаблица);

мсвТаблица = Новый Массив;
Для Каждого текСтрока Из ОбъектОбработки.ТехническиеХарактеристики Цикл 
		сткСтрока = Новый Структура;
		сткСтрока.Вставить("НаименованиеХарактеристики", текСтрока.НаименованиеХарактеристики);
		сткСтрока.Вставить("Характеристика", текСтрока.Характеристика);
		сткСтрока.Вставить("Значение", текСтрока.Значение);
		мсвТаблица.Добавить(сткСтрока);
КонецЦикла; 
Данные.Вставить("ТехническиеХарактеристики", мсвТаблица);

мсвТаблица = Новый Массив;
Для Каждого текСтрока Из ОбъектОбработки.ДополнительнаяКлассификация Цикл 
		сткСтрока = Новый Структура;
		сткСтрока.Вставить("ВидКлассификатора", текСтрока.ВидКлассификатора);
		сткСтрока.Вставить("Класс", текСтрока.Класс);
		мсвТаблица.Добавить(сткСтрока);
КонецЦикла; 
Данные.Вставить("ДополнительнаяКлассификация", мсвТаблица);

мсвТаблица = Новый Массив;
Для Каждого текСтрока Из ОбъектОбработки.ДополнительныеРеквизиты Цикл 
		сткСтрока = Новый Структура;
		сткСтрока.Вставить("Свойство", текСтрока.Свойство);
		сткСтрока.Вставить("Значение", текСтрока.Значение);
		сткСтрока.Вставить("ТекстоваяСтрока", текСтрока.ТекстоваяСтрока);
		мсвТаблица.Добавить(сткСтрока);
КонецЦикла; 
Данные.Вставить("ДополнительныеРеквизиты", мсвТаблица);

мсвТаблица = Новый Массив;
Для Каждого текСтрока Из ОбъектОбработки.Аналоги Цикл 
		сткСтрока = Новый Структура;
		сткСтрока.Вставить("Аналог", текСтрока.Аналог);
		мсвТаблица.Добавить(сткСтрока);
КонецЦикла; 
Данные.Вставить("Аналоги", мсвТаблица);

мсвТаблица = Новый Массив;
Для Каждого текСтрока Из ОбъектОбработки.Запчасти Цикл 
		сткСтрока = Новый Структура;
		сткСтрока.Вставить("Запчасть", текСтрока.Запчасть);
		мсвТаблица.Добавить(сткСтрока);
КонецЦикла; 
Данные.Вставить("Запчасти", мсвТаблица);

Данные.Вставить("Код", ОбъектОбработки.Код);
Данные.Вставить("Наименование", ОбъектОбработки.Наименование);
Данные.Вставить("Артикул", ОбъектОбработки.Артикул);
Данные.Вставить("КаталожныйНомер", ОбъектОбработки.КаталожныйНомер);
РезультатОбработки.Body = сшпОбщегоНазначения.ПреобразоватьСтруктуруПоФормату(ФорматСообщения, Данные);
