РезультатОбработки.ClassId = 2;
Данные = Новый Структура;

Данные.Вставить("ИмяПредопределенныхДанных", ОбъектОбработки.ИмяПредопределенныхДанных);
Данные.Вставить("Предопределенный", ОбъектОбработки.Предопределенный);
Данные.Вставить("Ссылка", ОбъектОбработки.Ссылка);
Данные.Вставить("Наименование", ОбъектОбработки.Наименование);
Данные.Вставить("Код", ОбъектОбработки.Код);
Данные.Вставить("ЗагружаетсяИзИнтернета", ОбъектОбработки.ЗагружаетсяИзИнтернета);
Данные.Вставить("НаименованиеПолное", ОбъектОбработки.НаименованиеПолное);
Данные.Вставить("Наценка", ОбъектОбработки.Наценка);
Данные.Вставить("ОсновнаяВалюта", ОбъектОбработки.ОсновнаяВалюта);
Данные.Вставить("ПараметрыПрописи", ОбъектОбработки.ПараметрыПрописи);
Данные.Вставить("ФормулаРасчетаКурса", ОбъектОбработки.ФормулаРасчетаКурса);
Данные.Вставить("СпособУстановкиКурса", ОбъектОбработки.СпособУстановкиКурса);

РезультатОбработки.Body = сшпОбщегоНазначения.ПреобразоватьСтруктуруПоФормату(ФорматСообщения, Данные);
