//Определение переменных
ПустойИдентификатор = "00000000-0000-0000-0000-000000000000";

//Получение тела сообщения
xdtoОбъект = сшпОбщегоНазначения.ПолучитьОбъектXDTO(ФорматСообщения, ОбъектСообщение.Body);

//Поиск объекта
ЗначениеДляПоиска = xdtoОбъект.Код;
новыйОбъект = Справочники.нсиМТР.НайтиПоКоду(ЗначениеДляПоиска);

Если новыйОбъект = Неопределено ИЛИ новыйОбъект.Пустая() Тогда
		новыйОбъект = Справочники.нсиМТР.СоздатьЭлемент();
Иначе
		новыйОбъект = новыйОбъект.ПолучитьОбъект();
КонецЕсли;


////////////////////////////////////////////////////////////////////////////////
//Реквизиты шапки

//Артикул
новыйОбъект.Артикул = xdtoОбъект.Получить("Артикул");

//КаталожныйНомер
новыйОбъект.КаталожныйНомер = xdtoОбъект.Получить("КаталожныйНомер");

//Наименование
новыйОбъект.Наименование = xdtoОбъект.Получить("Наименование");

//Код
новыйОбъект.Код = xdtoОбъект.Получить("Код");


//Запись объекта
новыйОбъект.ДополнительныеСвойства.Вставить("СШПНеобрабатывать", Истина);
новыйОбъект.Записать();
